app/Controllers/Auth/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
OR `email_user` = 'admin'
 LIMIT 1
---
    public function loginProses()
    {
        $user = new UserModel();
        $username = $_POST['user'];
        $password = $_POST['pass'];
        $dataUser = $user->where(['username' => $username,])->orWhere(['email_user' => $username])->first();