app/Controllers/Admin/Other.php

    public function jumlah()
    {
        $group =  $this->db->table('data_aset')->groupBy('code_store')->get()->getResultArray();
        $hasil =  $this->db->table('data_aset')->get()->getResultArray();
---
SELECT *
FROM `data_aset`
GROUP BY `code_store`
SELECT *
FROM `data_aset`