app/Controllers/User/User.php

SELECT *
FROM `store`
WHERE `nik_user` = '2220847'
AND `lokasi` = 1
AND `status` = 0
---
    public function FormMaintenance()
    {
        $hasil = $this->store->where(['nik_user' => session('nik_user'), 'lokasi' => 1, 'status' => 0])->findAll();

UPDATE `store` SET `status` = 1
WHERE `code_store` = 'C19'
---
                $data = [
                    'status' => 1,
                ];
                $this->db->table('store')->where(['code_store' => $id])->update($data);

SELECT *
FROM `store`
WHERE `nik_user` = '2220847'
AND `status` = 1
---
    public function ReportFormMaintenance()
    {
        $hasil = $this->store->where(['nik_user' => session('nik_user'), 'status' => 1])->findAll();

SELECT *
FROM `store`
WHERE `nama_store` = ' Kitchen Cideng'
---
    public function PrintRpt($store)
    {
        if ($store != null) {
            $query = $this->db->table('store')->getwhere(['nama_store' => $store]);