app/Views/User/layout/layout.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `code_permintaan`
FROM `tbl_permintaan`
WHERE `status` = 2
AND `nik_user` = '2220847'
) CI_count_all_results
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `code_permintaan`
FROM `tbl_newpermintaan`
WHERE `status` = 2
AND `nik_user` = '2220847'
) CI_count_all_results
---
                                    $db = \Config\Database::connect();
                                    $data = $db->table('tbl_permintaan');
                                    $dataq = $db->table('tbl_newpermintaan');
                                    $hasil = $data->distinct('code_permintaan')->select('code_permintaan')->where('status', 2)->where('nik_user', session('nik_user'))->CountAllResults();
                                    $hasil1 = $dataq->distinct('code_permintaan')->select('code_permintaan')->where('status', 2)->where('nik_user', session('nik_user'))->CountAllResults();