app/Views/User/FormMaintenance.php

SELECT *
FROM `data_aset`
WHERE `nama_store` = ' Kitchen Cideng'
AND `status` != 2
GROUP BY `kategori`
ORDER BY `kategori`
---
                        <?php
                        $this->db = \Config\Database::connect();
                        $data = $this->db->table('data_aset')->where(['nama_store' => $cari, 'status !=' => 2])->orderby('kategori')->groupby('kategori');
                        $hasil = $data->get()->getResultArray();

SELECT *
FROM `data_aset`
WHERE `code_store` = 'C19'
AND `kategori` = 'POS 1'
AND `status` != 2
---
                                <?php
                                $this->db = \Config\Database::connect();
                                $data = $this->db->table('data_aset')->where(['code_store' => $ds['code_store'], 'kategori' => $ds['kategori'], 'status !=' => 2]);
                                $hasil = $data->get()->getResultArray();