app/Models/AsetModel.php

    public function order_by()
    {
        $builder = $this->db->table('data_aset');
        $builder->select('*');
        $builder->where('nik_user', session('nik_user'));
        $builder->orwhere('nama_user', session('nama_user'));
        $builder->orderBy('kategori');
        $board = $builder->get()->getResultArray();
---
SELECT *
FROM `data_aset`
WHERE `nik_user` = '2220847'
OR `nama_user` = 'Nugraha Apec Tryawan'
ORDER BY `kategori`

    public function status()
    {
        $builder = $this->db->table('data_aset');
        $query = $builder->get()->getResult();
---
SELECT *
FROM `data_aset`