app/Models/StoreModel.php

    public function getDataAll()
    {
        $builder = $this->db->table('store');
        $hasil = $builder->select('nik_user')->where(['nik_user' => session('nik_user'), 'lokasi' => 1])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `store`
WHERE `nik_user` = '2220847'
AND `lokasi` = 1

    public function getDataAdmin()
    {
        $builder = $this->db->table('store');
        $hasil = $builder->where(['lokasi' => 1])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `store`
WHERE `lokasi` = 1

    public function getDataAdminL()
    {
        $builder = $this->db->table('store');
        $hasil = $builder->where(['lokasi' => 2])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `store`
WHERE `lokasi` = 2

    public function getAdminStatus()
    {
        $builder = $this->db->table('store');
        $maintenance = $builder->where(['status' => 1, 'lokasi' => 1])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `store`
WHERE `status` = 1
AND `lokasi` = 1

    public function getAdminStatus0()
    {
        $builder = $this->db->table('store');
        $maintenance = $builder->where(['status' => 0, 'lokasi' => 1])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `store`
WHERE `status` = 0
AND `lokasi` = 1

    public function getStatus1()
    {
        $builder = $this->db->table('store');
        $maintenance = $builder->select('nama_user')->where(['nik_user' => session('nik_user'), 'status' => 1, 'lokasi' => 1])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `store`
WHERE `nik_user` = '2220847'
AND `status` = 1
AND `lokasi` = 1

    public function lokasi2()
    {
        $builder = $this->db->table('store');
        $maintenance = $builder->select('nama_user')->where(['nik_user' => session('nik_user'), 'lokasi' => 2])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `store`
WHERE `nik_user` = '2220847'
AND `lokasi` = 2

    public function lokasi()
    {
        $builder = $this->db->table('store');
        $maintenance = $builder->select('nama_user')->where(['nik_user' => session('nik_user'), 'lokasi' => 1])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `store`
WHERE `nik_user` = '2220847'
AND `lokasi` = 1

    public function getStatus0()
    {
        $builder = $this->db->table('store');
        $maintenance1 = $builder->select('nama_user')->where(['nik_user' => session('nik_user'), 'status' => 0, 'lokasi' => 1])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `store`
WHERE `nik_user` = '2220847'
AND `status` = 0
AND `lokasi` = 1